export const DESCRIPTION =
  'Используя данную ниже шкалу, отметьте, в какой мере каждое из следующих утверждений отражает причины, по которым вы сейчас занимаетесь вашим видом спорта.';

export const QUESTIONS = [
  {
    id: 0,
    title: 'Ради удовольствия, которое мне приносит захватывающий жизненный опыт.'
  },
  {
    id: 1,
    title: 'Ради удовольствия узнавать больше о том виде спорта, которым я занимаюсь.'
  },
  {
    id: 2,
    title:
      'У меня были весомые причины заниматься спортом, но сейчас я сомневаюсь, продолжать ли это.'
  },
  {
    id: 3,
    title: 'Для удовольствия открывать новые упражнения и техники тренировки.'
  },
  {
    id: 4,
    title:
      'Я даже не знаю; у меня есть ощущение, что я не способен достичь успехов в моем виде спорта.'
  },
  {
    id: 5,
    title: 'Потому что это позволяет мне завоевать уважение знакомых.'
  },
  {
    id: 6,
    title: 'Потому что, на мой взгляд, это один из лучших способов знакомиться с новыми людьми.'
  },
  {
    id: 7,
    title: 'Потому что я чувствую удовлетворение собой во время выполнения трудных упражнений.'
  },
  {
    id: 8,
    title: 'Потому что это просто необходимо, заниматься спортом, если хочешь быть в форме.'
  },
  {
    id: 9,
    title: 'Ради престижа быть профессиональным спортсменом.'
  },
  {
    id: 10,
    title:
      'Потому что это один из лучших путей, который я выбрал, чтобы развивать другие стороны своей личности.'
  },
  {
    id: 11,
    title: 'Ради удовольствия, которое я чувствую, когда развиваю свои слабые стороны.'
  },
  {
    id: 12,
    title: 'Ради возбуждения, которое я чувствую, когда по-настоящему вовлечен в то, что я делаю.'
  },
  {
    id: 13,
    title: 'Потому что я должен заниматься спортом, чтобы чувствовать себя хорошо.'
  },
  {
    id: 14,
    title: 'Ради удовлетворения, которое я испытываю, когда совершенствую свои способности.'
  },
  {
    id: 15,
    title: 'Потому что окружающие считают, что это важно, поддерживать себя в форме.'
  },
  {
    id: 16,
    title:
      'Потому что это хороший способ узнать множество вещей, которые могут пригодиться и в других сферах моей деятельности.'
  },
  {
    id: 17,
    title:
      'Ради сильных эмоций, которые я испытываю во время занятий тем спортом, который мне нравится.'
  },
  {
    id: 18,
    title: 'Это уже непонятно мне; я не думаю, что мое место -  действительно в спорте.'
  },
  {
    id: 19,
    title: 'Для удовольствия, которое я чувствую при выполнении определенных сложных движений.'
  },
  {
    id: 20,
    title: 'Потому что я бы плохо себя чувствовал, если бы не нашел времени этим заниматься.'
  },
  {
    id: 21,
    title: 'Чтобы показать другим, насколько я хорош в моем виде спорта.'
  },
  {
    id: 22,
    title:
      'Ради удовольствия, которое я чувствую, когда пробую такие техники и упражнения, которых раньше не знал.'
  },
  {
    id: 23,
    title: 'Потому что это один из лучших способов поддерживать добрые отношения с друзьями.'
  },
  {
    id: 24,
    title: 'Потому что мне нравится ощущение, когда полностью отдаешься делу.'
  },
  {
    id: 25,
    title: 'Потому что я должен регулярно заниматься спортом.'
  },
  {
    id: 26,
    title: 'Ради удовольствия открывать новые стратегии достижения хороших результатов.'
  },
  {
    id: 27,
    title: 'Я не могу себе представить, как добиться тех целей, что я ставлю перед собой.'
  }
];

export const SPORT_MOTIVATION_SCALE_SAVE_INTERPRETATION = `athleteTests/SportMotivationScaleQuiz/SPORT_MOTIVATION_SCALE_SAVE_INTERPRETATION`;
export const SPORT_MOTIVATION_SCALE_SAVE_INTERPRETATION_ERROR = `athleteTests/SportMotivationScaleQuiz/SPORT_MOTIVATION_SCALE_SAVE_INTERPRETATION_ERROR`;
export const SPORT_MOTIVATION_SCALE_SAVE_INTERPRETATION_SUCCESS = `athleteTests/SportMotivationScaleQuiz/SPORT_MOTIVATION_SCALE_SAVE_INTERPRETATION_SUCCESS`;
