export const DESCRIPTION =
  'Представленные ниже утверждения используются профессиональными спортсменами при описании их переживаний. Пожалуйста, внимательно прочитайте каждое утверждение и оцените, как часто у вас бывает тот же опыт. Неправильных ответов здесь нет. Не задерживайтесь долго на одном утверждении. Пожалуйста, выберите ответ, который соответствует тому, как часто в спорте вы сталкиваетесь с подобными переживаниями.';

export const OPTIONS = [
  {
    id: 0,
    title: 'Редко',
    value: 0
  },
  {
    id: 1,
    title: 'Иногда',
    value: 1
  },
  {
    id: 2,
    title: 'Часто',
    value: 2
  },
  {
    id: 3,
    title: 'Почти всегда',
    value: 3
  }
];

export const QUESTIONS = [
  {
    id: 0,
    title:
      'Ежедневно или еженедельно я ставлю строго определенные цели, которые направляют меня в моих делах.'
  },
  {
    id: 1,
    title: 'Я в полной мере использую свои способности и навыки.'
  },
  {
    id: 2,
    title: 'Когда тренер делает мне замечание, я обычно анализирую это и следую его рекомендациям.'
  },
  {
    id: 3,
    title:
      'Занимаясь спортом, я могу сфокусировать внимание и не обращать внимания на отвлекающие моменты.'
  },
  {
    id: 4,
    title:
      'Во время соревнований я остаюсь позитивным (-ой) и сохраняю энтузиазм, вне зависимости от того, насколько плохо идут дела.'
  },
  {
    id: 5,
    title:
      'Обычно, испытывая психологическое давление, я выступаю лучше, потому что это позволяет мне мыслить более хладнокровно.'
  },
  {
    id: 6,
    title: 'Я слегка переживаю о том, что думают другие о моем выступлении.'
  },
  {
    id: 7,
    title: 'Обычно я стараюсь тщательно планировать шаги к достижению своих целей.'
  },
  {
    id: 8,
    title: 'Я уверен (-а) в том, что покажу хороший результат.'
  },
  {
    id: 9,
    title: 'Критика тренера расстраивает меня, но всегда помогает.'
  },
  {
    id: 10,
    title:
      'Мне с легкостью удаётся не давать отвлекающим мыслям мешать мне воспринимать то, что я смотрю или слушаю.'
  },
  {
    id: 11,
    title: 'Мое напряжение в основном связано с тем, что я волнуюсь, как я выступлю.'
  },
  {
    id: 12,
    title: 'Я устанавливаю собственные определенные цели для каждой тренировки.'
  },
  {
    id: 13,
    title: 'Меня не нужно заставлять выкладываться на тренировках, я и без этого усердно работаю.'
  },
  {
    id: 14,
    title:
      'Если мой тренер критикует или кричит на меня, я исправляю ошибку, не расстраиваясь из-за его реакции.'
  },
  {
    id: 15,
    title: 'В спорте я хорошо справляюсь с непредвиденными ситуациями.'
  },
  {
    id: 16,
    title:
      'Когда у меня что-то плохо получается, я говорю себе: сохраняй спокойствие! – и мне это помогает.'
  },
  {
    id: 17,
    title: 'Чем сильнее напряжение во время соревнований, тем больше мне это нравится.'
  },
  {
    id: 18,
    title:
      'На соревнованиях я переживаю из-за того, что мне придется преодолевать последствия своих ошибок или провалов.'
  },
  {
    id: 19,
    title:
      'Задолго до того, как начинаются соревнования, у меня в голове уже есть собственный выработанный план действий.'
  },
  {
    id: 20,
    title:
      'Когда я чувствую, что слишком напряжен (-а), я могу быстро расслабить мышцы и успокоиться.'
  },
  {
    id: 21,
    title: 'Для меня стрессовые ситуации – это вызов, который я принимаю.'
  },
  {
    id: 22,
    title: 'Я обдумываю и представляю себе, что случится, если я проиграю или допущу ошибку.'
  },
  {
    id: 23,
    title: 'Я контролирую свои эмоции, как бы ни складывались обстоятельства.'
  },
  {
    id: 24,
    title:
      'Для меня не составляет труда концентрировать свое внимание на каком-то одном предмете или человеке.'
  },
  {
    id: 25,
    title:
      'Когда у меня не получается достичь своих целей, это заставляет меня пробовать снова, прилагая еще больше усилий.'
  },
  {
    id: 26,
    title: 'Следуя советам тренера, я обычно совершенствую свои навыки.'
  },
  {
    id: 27,
    title: 'Я делаю меньше ошибок в условиях стресса, ведь так я лучше концентрируюсь.'
  }
];

export const COPING_STRATEGIES_SAVE_INTERPRETATION = `athleteTests/CopingStrategiesQuiz/COPING_STRATEGIES_SAVE_INTERPRETATION`;
export const COPING_STRATEGIES_SAVE_INTERPRETATION_ERROR = `athleteTests/CopingStrategiesQuiz/COPING_STRATEGIES_SAVE_INTERPRETATION_ERROR`;
export const COPING_STRATEGIES_SAVE_INTERPRETATION_SUCCESS = `athleteTests/CopingStrategiesQuiz/COPING_STRATEGIES_SAVE_INTERPRETATION_SUCCESS`;
