export const DESCRIPTION =
  'Перед вами 45 пар суждений, которые отражают различные причины занятия спортом. Выберите из пары то высказывание, которое больше всего подходит вам и отметьте, в какой степени оно вам больше подходит. Долго задумываться не надо, отмечайте первое подходящее суждение.';

export const QUESTIONS = [
  {
    id: 0,
    questions: [
      {
        title:
          'а) Я получаю радость от занятий спортом, так как могу двигаться и испытывать напряжение, Это меня воодушевляет и поднимает настроение.'
      },
      {
        title:
          'б) Если я буду регулярно тренироваться, то смогу показать высокие спортивные результаты, защищать честь своего коллектива, спортивного общества, нашей страны.'
      }
    ]
  },
  {
    id: 1,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это. Во время соревнований приятно быть в центре внимания, повышать свой престиж,'
      },
      {
        title:
          'б) Достичь хороших результатов в учебе и работе возможно, только если я буду здоров и физически развит. Этому содействует спорт.'
      }
    ]
  },
  {
    id: 2,
    questions: [
      {
        title:
          'а) Я активно занимаюсь спортом, потому что хочу развиться физически и закалить свой характер. Не хочу толстеть и стать ленивым, хочу быть здоровым.'
      },
      {
        title:
          'б) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил, поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      }
    ]
  },
  {
    id: 3,
    questions: [
      {
        title:
          'а) Мне нравятся занятия спортом, потому что соревноваться очень интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      },
      {
        title:
          'б) Я хочу разбираться в вопросах спортивной техники и тактики, принципах тренировочного процесса, знать, как правильнее тренироваться.'
      }
    ]
  },
  {
    id: 4,
    questions: [
      {
        title:
          'а) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад в это дело. Я не хочу подводить своего тренера и товарищей. Это заставляет меня больше тренироваться.'
      },
      {
        title:
          'б) Я регулярно тренируюсь, чтобы поддерживать и повышать достигнутые результаты, чтобы добиваться поставленной передо мной (мною) цели.'
      }
    ]
  },
  {
    id: 5,
    questions: [
      {
        title:
          'а) Я регулярно тренируюсь, чтобы обязательно поддерживать достигнутые спортивные результаты, чтобы повышать достижения и добиться поставленной передо мной (мною) цели.'
      },
      {
        title:
          'б) Мне нравятся занятия спортом, потому что соревноваться очень интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      }
    ]
  },
  {
    id: 6,
    questions: [
      {
        title:
          'а) Я хочу разбираться в вопросах спортивной техники и тактики, принципах тренировочного процесса, знать, как правильнее тренироваться.'
      },
      {
        title:
          'б) Я активно занимаюсь спортом, потому что хочу развиться физически и закалить свой характер. Не хочу толстеть и стать ленивым, хочу быть здоровым.'
      }
    ]
  },
  {
    id: 7,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил, поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      },
      {
        title:
          'б) Я занимаюсь спортом, так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это. Во время соревнований приятно быть в центре внимания, повышать свой престиж.'
      }
    ]
  },
  {
    id: 8,
    questions: [
      {
        title:
          'а) Достичь хороших результатов в учебе и работе возможно, только если я буду здоров и физически развит. Этому содействует спорт.'
      },
      {
        title:
          'б) Я получаю радость от занятий спортом, так как могу двигаться и испытывать напряжение. Это меня воодушевляет и поднимает настроение.'
      }
    ]
  },
  {
    id: 9,
    questions: [
      {
        title:
          'а) Если я буду регулярно тренироваться, то смогу показывать высокие спортивные результаты, защищать честь своего коллектива, спортивного общества, нашей страны.'
      },
      {
        title:
          'б) Я занимаюсь спортом, так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это. Во время соревнований приятно быть в центре внимания, повышать свой престиж.'
      }
    ]
  },
  {
    id: 10,
    questions: [
      {
        title:
          'а) Я активно занимаюсь спортом, потому что хочу развиться физически и закалить свой характер. Не хочу толстеть и стать ленивым, хочу быть здоровым.'
      },
      {
        title:
          'б) Я регулярно тренируюсь, чтобы поддерживать и повышать достигнутые результаты, чтобы добиваться поставленной передо мной (мною) цели.'
      }
    ]
  },
  {
    id: 11,
    questions: [
      {
        title:
          'а) Мне нравятся занятия спортом, потому что соревноваться очень интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      },
      {
        title:
          'б) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад в это дело. Я не хочу подводить своего тренера и товарищей. Это заставляет меня больше тренироваться.'
      }
    ]
  },
  {
    id: 12,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил. поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      },
      {
        title:
          'б) Я получаю радость от занятий спортом, так как могу двигаться и испытывать напряжение. Это меня воодушевляет и поднимает настроение.'
      }
    ]
  },
  {
    id: 13,
    questions: [
      {
        title:
          'а) Я хочу разбираться в вопросах спортивной техники и тактики, принципах тренировочного процесса, знать, как правильнее тренироваться.'
      },
      {
        title:
          'б) Я занимаюсь спортом, так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это. Во время соревнований приятно быть в центре внимания, повышать свой престиж.'
      }
    ]
  },
  {
    id: 14,
    questions: [
      {
        title:
          'а) Достичь хороших результатов в учебе и профессии возможно только, если я буду здоров и физически развит. Этому содействует спорт.'
      },
      {
        title:
          'б) Если я буду регулярно тренироваться, то смогу показывать высокие результаты, защищать честь своего коллектива, общества, нашей страны.'
      }
    ]
  },
  {
    id: 15,
    questions: [
      {
        title:
          'а) Я активно занимаюсь, спортом, потому что хочу развиться физически и закалить свой характер. Я не хочу потолстеть и стать, ленивым, хочу быть здоровым.'
      },
      {
        title:
          'б) Мне нравятся занятия спортом, потому что соревноваться очень интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      }
    ]
  },
  {
    id: 16,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил, поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      },
      {
        title:
          'б) Я хочу разбираться в вопросах спортивной техники и тактики, принципах тренировочного процесса, знать, как правильнее тренироваться.'
      }
    ]
  },
  {
    id: 17,
    questions: [
      {
        title:
          'а) Я регулярно тренируюсь, чтобы поддерживать и повышать достигнутые результаты, чтобы добиваться поставленной передо мной (мною) цели.'
      },
      {
        title:
          'б) Я занимаюсь спортом, так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это. Во время соревнований приятно быть в центре внимания, повышать свой престиж.'
      }
    ]
  },
  {
    id: 18,
    questions: [
      {
        title:
          'а) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад в это дело. Я не хочу подводить своего тренера и товарищей. Это заставляет меня больше тренироваться.'
      },
      {
        title:
          'б) Я получаю радость от занятий спортом, так как могу двигаться и испытывать напряжение, Это меня воодушевляет и поднимает настроение.'
      }
    ]
  },
  {
    id: 19,
    questions: [
      {
        title:
          'а) Если я буду регулярно тренироваться, то смогу показывать высокие спортивные результаты, защищать честь своего коллектива спортивного общества, нашей страны.'
      },
      {
        title:
          'б) Мне нравятся занятия спортом, потому что соревноваться очень интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      }
    ]
  },
  {
    id: 20,
    questions: [
      {
        title:
          'а ) Достичь хороших результатов в учебе и работе возможно, только если я буду здоров и физически развит. Этому содействует спорт.'
      },
      {
        title:
          'б) Я активно занимаюсь спортом, потому что хочу развиться физически и закалить свой характер. Не хочу потолстеть и стать, ленивым, хочу быть здоровым.'
      }
    ]
  },
  {
    id: 21,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил, поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      },
      {
        title:
          'б) Я регулярно тренируюсь, чтобы поддерживать и повышать достигнутые результаты, чтобы добиваться поставленной передо мной (мною) цели.'
      }
    ]
  },
  {
    id: 22,
    questions: [
      {
        title:
          'а) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад, в это дело. Я не хочу подводить своего тренера и товарищей. Это заставляет меня больше тренироваться.'
      },
      {
        title:
          'б) Достичь хороших результатов в учебе и работе возможно, только если я буду здоров и физически развит. Этому содействует спорт.'
      }
    ]
  },
  {
    id: 23,
    questions: [
      {
        title:
          'а) Я регулярно тренируюсь, чтобы поддерживать и повышать достигнутые результаты, чтобы добиваться   поставленной передо мной (мною) цели.'
      },
      {
        title:
          'б) Если я буду регулярно тренироваться, то смогу показывать высокие спортивные результаты, защищать честь, своего коллектива, спортивного общества, нашей страны.'
      }
    ]
  },
  {
    id: 24,
    questions: [
      {
        title:
          'а) Я получаю радость от занятий спортом, так как могу двигаться и испытывать напряжение. Это меня воодушевляет и поднимает настроение.'
      },
      {
        title:
          'б) Я занимаюсь спортом так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это. Во время соревнований приятно быть в центре внимания, повышать свой престиж.'
      }
    ]
  },
  {
    id: 25,
    questions: [
      {
        title:
          'а) Я активно занимаюсь спортом, потому что хочу развиться физически и закалить свой характер. Не хочу толстеть и стать ленивым, хочу быть здоровым.'
      },
      {
        title:
          'б) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад в это дело. Я не хочу подводить своего тренера и товарищей. Это заставляет меня больше тренироваться.'
      }
    ]
  },
  {
    id: 26,
    questions: [
      {
        title:
          'а) Я хочу разбираться в вопросах спортивной техники и тактики, принципах тренировочного процесса, знать, как правильнее тренироваться.'
      },
      {
        title:
          'б) Если я буду регулярно тренироваться, то смогу показывать высокие спортивные результаты, защищать честь своего коллектива, спортивного общества, нашей страны.'
      }
    ]
  },
  {
    id: 27,
    questions: [
      {
        title:
          'а) Мне нравятся занятия спортом, потому что соревноваться очень интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      },
      {
        title:
          'б) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил, поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      }
    ]
  },
  {
    id: 28,
    questions: [
      {
        title:
          'а) Достичь хороших результатов в учебе и работе возможно, только если я буду здоров и физически развит. Этому содействует спорт.'
      },
      {
        title:
          'б) Я регулярно тренируюсь, чтобы поддерживать и повышать достигнутые результаты, чтобы, добиваться поставленной передо мной (мною) цели.'
      }
    ]
  },
  {
    id: 29,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это.  Во время соревнований приятно быть в центре внимания, повышать свой престиж.'
      },
      {
        title:
          'б) Мне нравятся занятия спортом, потому что соревноваться очень интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      }
    ]
  },
  {
    id: 30,
    questions: [
      {
        title:
          'а) Я получаю радость от занятий спортом, так как могу двигаться и испытывать напряжение.  Это меня воодушевляет и поднимает настроение.'
      },
      {
        title:
          'Я активно занимаюсь спортом, потому что хочу развиться физически и закалить свой характер. Не хочу толстеть и стать ленивым, хочу быть здоровым.'
      }
    ]
  },
  {
    id: 31,
    questions: [
      {
        title:
          'а) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад в это дело. Я не хочу подводить своего тренера и товарищей. Это заставляет, меня больше тренироваться.'
      },
      {
        title:
          'б) Я хочу разбираться в вопросах спортивной техники и тактики, принципах тренировочного процесса, знать, как правильнее тренироваться.'
      }
    ]
  },
  {
    id: 32,
    questions: [
      {
        title:
          'а) Если я буду регулярно тренироваться, то смогу показывать высокие спортивные результаты, защищать честь своего коллектива, спортивного общества, нашей страны.'
      },
      {
        title:
          'б) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил, поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      }
    ]
  },
  {
    id: 33,
    questions: [
      {
        title:
          'а) Мне нравятся занятия спортом, потому что соревноваться очень  интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      },
      {
        title:
          'б) Достичь хороших результатов и учебе и работе возможно, только если я буду здоров и физически развит. Этому содействует спорт.'
      }
    ]
  },
  {
    id: 34,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это.  Во время соревнований приятно быть в центре внимания, повышать свой престиж.'
      },
      {
        title:
          'б) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад в это дело. Я не хочу подводить своего тренера и товарищей Эго заставляет меня больше тренироваться.'
      }
    ]
  },
  {
    id: 35,
    questions: [
      {
        title:
          'а) Я регулярно тренируюсь, чтобы поддерживать и повышать достигнутые результаты, чтобы доживаться поставленной передо мной (мною) цели.'
      },
      {
        title:
          'б) Я получаю радость от занятий спортом, так как моту двигаться и испытывать напряжение. Это меня воодушевляет и поднимает настроение.'
      }
    ]
  },
  {
    id: 36,
    questions: [
      {
        title:
          'а) Я хочу разбираться а вопросах спортивной техники и тактики, принципах тренировочного процесса, знать, как правильнее тренироваться.'
      },
      {
        title:
          'б) Достичь хороших результатов в учебе и работе возможно, только если я буду здоров и физически развит. Этому содействует спорт.'
      }
    ]
  },
  {
    id: 37,
    questions: [
      {
        title:
          'а) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад в это дело. Я не хочу подводить своего тренера и товарищей. Это заставляет меня больше тренироваться.'
      },
      {
        title:
          'б) Если я буду регулярно тренироваться, то смогу показывать высокие спортивные результаты, защищать честь своего коллектива, спортивного общества, нашей страны.'
      }
    ]
  },
  {
    id: 38,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил, поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      },
      {
        title:
          'б) Достичь хорошие результаты в учебе и работе возможно, только если я буду здоров и физически развит. Этому содействует спорт.'
      }
    ]
  },
  {
    id: 39,
    questions: [
      {
        title:
          'а) Я получаю радость от занятий спортом, так как могу двигаться и испытывать напряжение. Это меня  воодушевляет и поднимает настроение.'
      },
      {
        title:
          'б) Мне нравятся занятия спортом, потому что соревноваться очень интересно, потому что радуют достигнутые успехи. Я люблю атмосферу соревнований.'
      }
    ]
  },
  {
    id: 40,
    questions: [
      {
        title:
          'а) Я активно занимаюсь спортом, потому что хочу развиваться физически и закалять свой характер. Не хочу потолстеть и стать ленивым, хочу быть здоровым.'
      },
      {
        title:
          'б) Я занимаюсь спортом, так как добиваюсь успехов. Мои товарищи по школе и спортивной команде, так же как и зрители, уважают меня за это. Во время соревнований приятно быть в центре внимания, повышать свои престиж.'
      }
    ]
  },
  {
    id: 41,
    questions: [
      {
        title:
          'а) Я регулярно тренируюсь, чтобы поддерживать и повышать достигнутые результаты, чтобы добиваться поставленной передо мной (мною) цели.'
      },
      {
        title:
          'б) Я хочу разбираться в вопросах спортивной техники и тактики, принципах тренировочного процесса, знать, как правильнее тренироваться.'
      }
    ]
  },
  {
    id: 42,
    questions: [
      {
        title:
          'а) Я занимаюсь спортом, чтобы отдохнуть от умственной (сидячей) работы, чтобы получить прилив сил, поэтому спорт для меня - хобби. Спортивные результаты интересуют меня в меньшей степени.'
      },
      {
        title:
          'б) Моя спортивная команда должна занимать лидирующее положение. Я хочу внести свой вклад в это дело. Не могу подводить своего тренера и товарищей. Это заставляет меня больше тренироваться.'
      }
    ]
  },
  {
    id: 43,
    questions: [
      {
        title:
          'а) Если я буду регулярно тренироваться, то смогу показывать высокие спортивные результаты, защищать честь своего коллектива, спортивного общества, нашей страны.'
      },
      {
        title:
          'б) Я активно занимаюсь спортом, поэтому что хочу развиться физически и закалить свой характер. Не хочу толстеть и стать ленивым, хочу быть здоровым.'
      }
    ]
  },
  {
    id: 44,
    questions: [
      {
        title:
          'а) Я получаю радость от занятий спортом, так как могу двигаться и испытывать напряжение. Это меня воодушевляет и поднимает настроение.'
      },
      {
        title:
          'б) Я хочу разбираться в вопросах спортивной техники и тактики, принципах тренировочного процесса, знать как правильно тренироваться.'
      }
    ]
  }
];

export const SPORT_MOTIVATION_SAVE_INTERPRETATION = `athleteTests/SportMotivationQuiz/SPORT_MOTIVATION_SAVE_INTERPRETATION`;
export const SPORT_MOTIVATION_SAVE_INTERPRETATION_ERROR = `athleteTests/SportMotivationQuiz/SPORT_MOTIVATION_SAVE_INTERPRETATION_ERROR`;
export const SPORT_MOTIVATION_SAVE_INTERPRETATION_SUCCESS = `athleteTests/SportMotivationQuiz/SPORT_MOTIVATION_SAVE_INTERPRETATION_SUCCESS`;
